ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/InformationRegisters/УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами/УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами</name>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Время</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пункт1</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_ПунктыМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пункт2</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_ПунктыМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/CommonModules/УТЗ_ПЛ_ПунктыМаршрута/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с пунктами маршрута
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Функция - Возвращает данные о времени ездки и расстоянии между пунктами маршрута для автотранспорта
//
// Параметры:
//  Автотранспорт	 - СправочникСсылка.УТЗ_ПЛ_Автотранспорт 	 - 
//  ПунктУбытия		 - СправочникСсылка.УТЗ_ПЛ_ПунктыМаршрута	 - 
//  ПунктПрибытия	 - СправочникСсылка.УТЗ_ПЛ_ПунктыМаршрута	 - 
// 
// Возвращаемое значение:
//  Структура:
//		* ВремяВПути - Дата - Если данные не найдены, возвращается пустая дата
//		* Расстояние - Число - Если данные не найдены, возвращается 0
//	
Функция ВремяРасстояниеМеждуПунктамиМаршрута(Автотранспорт, ПунктУбытия, ПунктПрибытия) Экспорт
	
	ПараметрыОтвета = Новый Структура;
	ПараметрыОтвета.Вставить("ВремяВПути", Дата(1, 1, 1));
	ПараметрыОтвета.Вставить("Расстояние", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Расстояние КАК Расстояние,
		|	УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Время КАК ВремяВПути
		|ИЗ
		|	РегистрСведений.УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами КАК УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами
		|ГДЕ
		|	УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Автотранспорт = &Автотранспорт
		|	И УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Пункт1 = &Пункт1
		|	И УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Пункт2 = &Пункт2";
	
	Запрос.УстановитьПараметр("Автотранспорт", Автотранспорт);
	Запрос.УстановитьПараметр("Пункт1", ПунктУбытия);
	Запрос.УстановитьПараметр("Пункт2", ПунктПрибытия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ПараметрыОтвета, Выборка);
	КонецЕсли;
	
	Возврат ПараметрыОтвета;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
